; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=249, out_folder=htg/blocksworld/training, instance_id=43, seed=2067, goal_proportion=0.03

(define (problem blocksworld-43)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 - object)
 (:init 
    (arm-empty)
    (clear b94)
    (on b94 b174)
    (on b174 b223)
    (on b223 b247)
    (on b247 b101)
    (on b101 b149)
    (on b149 b28)
    (on b28 b162)
    (on b162 b134)
    (on b134 b148)
    (on b148 b83)
    (on b83 b57)
    (on b57 b248)
    (on b248 b200)
    (on-table b200)
    (clear b184)
    (on b184 b211)
    (on b211 b75)
    (on b75 b43)
    (on b43 b240)
    (on b240 b72)
    (on b72 b171)
    (on b171 b78)
    (on b78 b221)
    (on b221 b131)
    (on b131 b41)
    (on b41 b109)
    (on b109 b26)
    (on-table b26)
    (clear b170)
    (on b170 b96)
    (on b96 b86)
    (on-table b86)
    (clear b239)
    (on b239 b132)
    (on-table b132)
    (clear b33)
    (on b33 b73)
    (on b73 b90)
    (on b90 b218)
    (on b218 b95)
    (on b95 b80)
    (on-table b80)
    (clear b54)
    (on-table b54)
    (clear b236)
    (on b236 b34)
    (on b34 b113)
    (on b113 b181)
    (on b181 b13)
    (on-table b13)
    (clear b30)
    (on-table b30)
    (clear b141)
    (on b141 b98)
    (on b98 b197)
    (on b197 b210)
    (on b210 b173)
    (on b173 b74)
    (on b74 b188)
    (on b188 b224)
    (on b224 b169)
    (on b169 b60)
    (on b60 b107)
    (on b107 b61)
    (on b61 b222)
    (on-table b222)
    (clear b66)
    (on b66 b126)
    (on b126 b77)
    (on b77 b114)
    (on b114 b104)
    (on b104 b216)
    (on b216 b187)
    (on b187 b128)
    (on b128 b166)
    (on b166 b105)
    (on b105 b22)
    (on b22 b102)
    (on b102 b172)
    (on-table b172)
    (clear b206)
    (on-table b206)
    (clear b139)
    (on b139 b199)
    (on b199 b106)
    (on b106 b39)
    (on-table b39)
    (clear b230)
    (on b230 b227)
    (on b227 b93)
    (on b93 b9)
    (on b9 b87)
    (on-table b87)
    (clear b11)
    (on b11 b14)
    (on-table b14)
    (clear b120)
    (on-table b120)
    (clear b213)
    (on b213 b175)
    (on-table b175)
    (clear b48)
    (on b48 b125)
    (on-table b125)
    (clear b103)
    (on-table b103)
    (clear b182)
    (on-table b182)
    (clear b191)
    (on b191 b2)
    (on b2 b243)
    (on-table b243)
    (clear b194)
    (on b194 b190)
    (on b190 b68)
    (on b68 b152)
    (on b152 b56)
    (on b56 b27)
    (on-table b27)
    (clear b100)
    (on b100 b161)
    (on b161 b229)
    (on-table b229)
    (clear b67)
    (on b67 b151)
    (on b151 b146)
    (on b146 b124)
    (on b124 b82)
    (on b82 b163)
    (on b163 b88)
    (on b88 b19)
    (on b19 b234)
    (on-table b234)
    (clear b97)
    (on b97 b246)
    (on b246 b202)
    (on-table b202)
    (clear b205)
    (on b205 b219)
    (on b219 b179)
    (on b179 b118)
    (on b118 b36)
    (on b36 b122)
    (on-table b122)
    (clear b225)
    (on b225 b69)
    (on-table b69)
    (clear b158)
    (on b158 b37)
    (on b37 b226)
    (on b226 b241)
    (on b241 b135)
    (on-table b135)
    (clear b127)
    (on b127 b110)
    (on-table b110)
    (clear b55)
    (on b55 b217)
    (on-table b217)
    (clear b76)
    (on b76 b185)
    (on b185 b20)
    (on b20 b59)
    (on b59 b44)
    (on-table b44)
    (clear b70)
    (on b70 b235)
    (on b235 b35)
    (on b35 b91)
    (on-table b91)
    (clear b7)
    (on b7 b112)
    (on-table b112)
    (clear b4)
    (on-table b4)
    (clear b18)
    (on b18 b99)
    (on b99 b51)
    (on b51 b46)
    (on b46 b157)
    (on b157 b220)
    (on-table b220)
    (clear b233)
    (on b233 b21)
    (on b21 b192)
    (on-table b192)
    (clear b108)
    (on b108 b136)
    (on b136 b53)
    (on b53 b193)
    (on b193 b209)
    (on b209 b38)
    (on-table b38)
    (clear b40)
    (on-table b40)
    (clear b16)
    (on-table b16)
    (clear b155)
    (on b155 b84)
    (on b84 b207)
    (on b207 b159)
    (on-table b159)
    (clear b65)
    (on-table b65)
    (clear b17)
    (on b17 b153)
    (on-table b153)
    (clear b249)
    (on b249 b50)
    (on-table b50)
    (clear b201)
    (on b201 b160)
    (on-table b160)
    (clear b23)
    (on b23 b115)
    (on b115 b242)
    (on b242 b143)
    (on b143 b195)
    (on-table b195)
    (clear b164)
    (on b164 b208)
    (on b208 b138)
    (on b138 b180)
    (on-table b180)
    (clear b154)
    (on b154 b186)
    (on b186 b3)
    (on b3 b137)
    (on-table b137)
    (clear b196)
    (on b196 b6)
    (on-table b6)
    (clear b45)
    (on-table b45)
    (clear b81)
    (on b81 b129)
    (on-table b129)
    (clear b58)
    (on-table b58)
    (clear b49)
    (on b49 b189)
    (on b189 b231)
    (on b231 b204)
    (on b204 b165)
    (on b165 b5)
    (on-table b5)
    (clear b12)
    (on b12 b177)
    (on b177 b237)
    (on-table b237)
    (clear b212)
    (on b212 b89)
    (on b89 b111)
    (on b111 b71)
    (on b71 b79)
    (on-table b79)
    (clear b142)
    (on-table b142)
    (clear b15)
    (on b15 b215)
    (on b215 b25)
    (on b25 b203)
    (on b203 b178)
    (on b178 b232)
    (on b232 b8)
    (on-table b8)
    (clear b62)
    (on b62 b244)
    (on b244 b214)
    (on b214 b85)
    (on-table b85)
    (clear b167)
    (on b167 b116)
    (on b116 b117)
    (on b117 b156)
    (on-table b156)
    (clear b1)
    (on b1 b31)
    (on-table b31)
    (clear b183)
    (on b183 b228)
    (on b228 b92)
    (on-table b92)
    (clear b29)
    (on b29 b198)
    (on b198 b168)
    (on-table b168)
    (clear b47)
    (on b47 b121)
    (on b121 b147)
    (on b147 b145)
    (on b145 b32)
    (on b32 b64)
    (on b64 b176)
    (on b176 b42)
    (on b42 b119)
    (on b119 b133)
    (on b133 b63)
    (on b63 b140)
    (on b140 b238)
    (on b238 b123)
    (on b123 b144)
    (on b144 b10)
    (on b10 b245)
    (on b245 b150)
    (on-table b150)
    (clear b52)
    (on b52 b130)
    (on b130 b24)
    (on-table b24))
 (:goal  (and 
    (clear b5)
    (on-table b5)
    (clear b7)
    (on b7 b4)
    (on-table b4)
    (clear b2)
    (on b2 b6)
    (on b6 b3)
    (on-table b3)
    (clear b1)
    (on-table b1))))

; plan
1. (unstack b1 b31)
   deleted: (on b1 b31) (clear b1) (arm-empty)
   added: (holding b1) (clear b31)
   goals met: 3 of 11
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 5 of 11
3. (unstack b154 b186)
   deleted: (on b154 b186) (clear b154) (arm-empty)
   added: (holding b154) (clear b186)
   goals met: 5 of 11
4. (putdown b154)
   deleted: (holding b154)
   added: (clear b154) (arm-empty) (on-table b154)
   goals met: 5 of 11
5. (unstack b186 b3)
   deleted: (on b186 b3) (clear b186) (arm-empty)
   added: (holding b186) (clear b3)
   goals met: 5 of 11
6. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 5 of 11
7. (unstack b3 b137)
   deleted: (on b3 b137) (clear b3) (arm-empty)
   added: (holding b3) (clear b137)
   goals met: 5 of 11
8. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 11
9. (unstack b191 b2)
   deleted: (on b191 b2) (clear b191) (arm-empty)
   added: (holding b191) (clear b2)
   goals met: 7 of 11
10. (putdown b191)
   deleted: (holding b191)
   added: (clear b191) (arm-empty) (on-table b191)
   goals met: 7 of 11
11. (unstack b196 b6)
   deleted: (on b196 b6) (clear b196) (arm-empty)
   added: (holding b196) (clear b6)
   goals met: 7 of 11
12. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 7 of 11
13. (unstack b49 b189)
   deleted: (on b49 b189) (clear b49) (arm-empty)
   added: (holding b49) (clear b189)
   goals met: 7 of 11
14. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 7 of 11
15. (unstack b189 b231)
   deleted: (on b189 b231) (clear b189) (arm-empty)
   added: (holding b189) (clear b231)
   goals met: 7 of 11
16. (putdown b189)
   deleted: (holding b189)
   added: (clear b189) (arm-empty) (on-table b189)
   goals met: 7 of 11
17. (unstack b231 b204)
   deleted: (on b231 b204) (clear b231) (arm-empty)
   added: (holding b231) (clear b204)
   goals met: 7 of 11
18. (putdown b231)
   deleted: (holding b231)
   added: (clear b231) (arm-empty) (on-table b231)
   goals met: 7 of 11
19. (unstack b204 b165)
   deleted: (on b204 b165) (clear b204) (arm-empty)
   added: (holding b204) (clear b165)
   goals met: 7 of 11
20. (putdown b204)
   deleted: (holding b204)
   added: (clear b204) (arm-empty) (on-table b204)
   goals met: 7 of 11
21. (unstack b165 b5)
   deleted: (on b165 b5) (clear b165) (arm-empty)
   added: (holding b165) (clear b5)
   goals met: 8 of 11
22. (putdown b165)
   deleted: (holding b165)
   added: (clear b165) (arm-empty) (on-table b165)
   goals met: 8 of 11
23. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 8 of 11
24. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 9 of 11
25. (unstack b2 b243)
   deleted: (on b2 b243) (clear b2) (arm-empty)
   added: (holding b2) (clear b243)
   goals met: 8 of 11
26. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 10 of 11
27. (unstack b7 b112)
   deleted: (on b7 b112) (clear b7) (arm-empty)
   added: (holding b7) (clear b112)
   goals met: 9 of 11
28. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 11 of 11
